source/python-docutils/base.dot
digraph G {
    graph [
        fontname = "Bitstream Vera Sans"
        fontsize = 9
        ranksep = 0.2
        splines = ortho
    ]
    node [
        fontname = "Bitstream Vera Sans"
        fontsize = 9
        shape = "record"
    ]
    edge [
        arrowtail = empty
        dir = back
        fontname = "Bitstream Vera Sans"
        fontsize = 9
    ]

    SettingsSpec [
        label = "{SettingsSpec
        |+ settings_spec : tuple\l+ settings_defaults : dict\l+ settings_default_overrides : dict\l+ relative_path_settings : tuple\l+ config_section : str\l+ config_section_dependencies : tuple\l
        |}"
    ]
    TransformSpec [
        label = "{TransformSpec
        |
        |+ get_transforms()\l}"
    ]
    Component [
        label = "{Component
        |+ component_type : str\l+ supported : tuple\l
        |+ supports(str) : bool\l}"
    ]

    { rank = same ; SettingsSpec, TransformSpec }

    // elbow nodes
    node [
        shape = circle
        label = ""
        height = 0
        width = 0
    ]

    { rank = same ; a, b, c }

    //TransformSpec, SettingsSpec -> Component
    TransformSpec -> a
    SettingsSpec -> c

    // elbow edges
    edge [
        arrowhead = none
        arrowtail = none
        dir = none
    ]

    a -> b -> c [ constraint = false ]
    b -> Component
}
